Classes | Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::TransitionDefault Class Reference
MEP Element Manager
The TransitionDefault contains the necessary non-geometric data for creating and modifying a Transition. More...
#include <MEPTransitionDefault.hpp>
 Inheritance diagram for ACAPI::MEP::TransitionDefault:
 Classes
class  | Modifier
Modifier of the TransitionDefault. More...
 Public Member Functions
Result< double >  | GetAngle () const
The length of the Transition is calculated with the help of this value in the case of Duct and Cable Carrier.
double  | GetOffsetY () const
double  | GetOffsetZ () const
Result< UniqueID >  | GetPreferenceTable () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
TransitionDefault (std::shared_ptr< Impl::ITransitionDefaultImpl > impl)
Constructs a TransitionDefault with the given implementation.
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< TransitionDefault >  | Create (const API_Token &token, Domain domain)
Creates a TransitionDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< TransitionDefault >  | CreateTransitionDefault (Domain domain)
Creates a TransitionDefault.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The TransitionDefault contains the necessary non-geometric data for creating and modifying a Transition.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingNodeDefault
Constructor & Destructor Documentation
◆ TransitionDefault()
 ACAPI::MEP::TransitionDefault::TransitionDefault  |  ( |  std::shared_ptr< Impl::ITransitionDefaultImpl > |  impl | )
protected
Constructs a TransitionDefault with the given implementation.
Parameters
impl | The given implementation.
Member Function Documentation
◆ Create()
 static Result< TransitionDefault > ACAPI::MEP::TransitionDefault::Create  |  ( |  const API_Token & |  token,
|  Domain |  domain )
staticprotected
Creates a TransitionDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result of the creation with the created TransitionDefault.
◆ GetAngle()
 Result< double > ACAPI::MEP::TransitionDefault::GetAngle  |  ( |   | ) |   const
The length of the Transition is calculated with the help of this value in the case of Duct and Cable Carrier.
Returns
Returns the angle of the TransitionDefault in degrees in the case of Duct and Cable Carrier, otherwise Error.
◆ GetOffsetY()
 double ACAPI::MEP::TransitionDefault::GetOffsetY  |  ( |   | ) |   const
Returns
Returns the offset of the TransitionDefault in the Y direction.
◆ GetOffsetZ()
 double ACAPI::MEP::TransitionDefault::GetOffsetZ  |  ( |   | ) |   const
Returns
Returns the offset of the TransitionDefault in the Z direction.
◆ GetPreferenceTable()
 Result< UniqueID > ACAPI::MEP::TransitionDefault::GetPreferenceTable  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable of a PipeTransitionDefault or a DuctTransitionDefault, in case of CableCarrierTransitionDefault returns Error.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::TransitionDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateTransitionDefault
 Result< TransitionDefault > CreateTransitionDefault  |  ( |  Domain |  domain | )
friend
Creates a TransitionDefault.
Parameters
domain | The Domain of the requested TransitionDefault.
Returns
If able, returns a copy of Archicad's current Default of the Transition from the RoutingElement tool for the domain defined by the parameter, otherwise Error.